Revit 2025 API
StructuralReleaseType Enumeration
 Type of structural release, which is used for the BuiltIn parameter STRUCTURAL_END_RELEASE_TYPE.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralReleaseType
Public Enumeration StructuralReleaseType
public enum class StructuralReleaseType
type StructuralReleaseType
Members
Member name | Value | Description
kFixed | 0
kPinned | 1
kBendingMoment | 2
kUserDefined | 3
See Also
Reference
Autodesk.Revit.DB Namespace